Revit 2026 API

# TableCellCombinedParameterDataSampleValue Property

---

The sample/example value for the parameter in text form

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SampleValue { get; set; }
```
```vb
Public Property SampleValue As String
	Get
	Set
```
```cpp
public:
property String^ SampleValue {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SampleValue : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

TableCellCombinedParameterData Class

Autodesk.Revit.DB Namespace